Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_iisc.h
/* -------- IISC_THR : (IISC Offset: 0x24) ( /W 32) Transmit Holding Register -------- */
#define IISC_THR_OFFSET             0x24         /**< \brief (IISC_THR offset) Transmit Holding Register */

#define IISC_THR_TDAT_Pos           0            /**< \brief (IISC_THR) Transmit Data */
#define IISC_THR_TDAT_Msk           (0xFFFFFFFFu << IISC_THR_TDAT_Pos)
#define IISC_THR_TDAT(value)        ((IISC_THR_TDAT_Msk & ((value) << IISC_THR_TDAT_Pos)))
#define IISC_THR_MASK               0xFFFFFFFFu  /**< \brief (IISC_THR) MASK Register */

/* -------- IISC_VERSION : (IISC Offset: 0x28) (R/  32) Version Register -------- */
#define IISC_VERSION_OFFSET         0x28         /**< \brief (IISC_VERSION offset) Version Register */
#define IISC_VERSION_RESETVALUE     0x00000100   /**< \brief (IISC_VERSION reset_value) Version Register */

#define IISC_VERSION_VERSION_Pos    0            /**< \brief (IISC_VERSION) Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell. */
#define IISC_VERSION_VERSION_Msk    (0xFFFu << IISC_VERSION_VERSION_Pos)
#define IISC_VERSION_VERSION(value) ((IISC_VERSION_VERSION_Msk & ((value) << IISC_VERSION_VERSION_Pos)))
#define IISC_VERSION_VARIANT_Pos    16           /**< \brief (IISC_VERSION) Reserved. Value subject to change. No functionality associated. */
#define IISC_VERSION_VARIANT_Msk    (0xFu << IISC_VERSION_VARIANT_Pos)
#define IISC_VERSION_VARIANT(value) ((IISC_VERSION_VARIANT_Msk & ((value) << IISC_VERSION_VARIANT_Pos)))
#define IISC_VERSION_MASK           0x000F0FFFu  /**< \brief (IISC_VERSION) MASK Register */

/* -------- IISC_PARAMETER : (IISC Offset: 0x2C) (R/  32) Parameter Register -------- */
#define IISC_PARAMETER_OFFSET       0x2C         /**< \brief (IISC_PARAMETER offset) Parameter Register */
#define IISC_PARAMETER_RESETVALUE   0x00010000   /**< \brief (IISC_PARAMETER reset_value) Parameter Register */

#define IISC_PARAMETER_FORMAT_Pos   7            /**< \brief (IISC_PARAMETER) Data protocol format */
#define IISC_PARAMETER_FORMAT       (0x1u << IISC_PARAMETER_FORMAT_Pos)
#define   IISC_PARAMETER_FORMAT_I2S (0x0u <<  7) /**< \brief (IISC_PARAMETER) I2S format, stereo with IWS low for left channel */
#define IISC_PARAMETER_NBCHAN_Pos   16           /**< \brief (IISC_PARAMETER) Maximum number of channels - 1 */
#define IISC_PARAMETER_NBCHAN_Msk   (0x1Fu << IISC_PARAMETER_NBCHAN_Pos)
#define IISC_PARAMETER_NBCHAN(value) ((IISC_PARAMETER_NBCHAN_Msk & ((value) << IISC_PARAMETER_NBCHAN_Pos)))
#define IISC_PARAMETER_MASK         0x001F0080u  /**< \brief (IISC_PARAMETER) MASK Register */

/** \brief IISC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  WoReg   IISC_CR;            /**< \brief (IISC Offset: 0x00) Control Register */
  RwReg   IISC_MR;            /**< \brief (IISC Offset: 0x04) Mode Register */
  RoReg   IISC_SR;            /**< \brief (IISC Offset: 0x08) Status Register */
  WoReg   IISC_SCR;           /**< \brief (IISC Offset: 0x0C) Status Clear Register */
  WoReg   IISC_SSR;           /**< \brief (IISC Offset: 0x10) Status Set Register */
  WoReg   IISC_IER;           /**< \brief (IISC Offset: 0x14) Interrupt Enable Register */
  WoReg   IISC_IDR;           /**< \brief (IISC Offset: 0x18) Interrupt Disable Register */
  RoReg   IISC_IMR;           /**< \brief (IISC Offset: 0x1C) Interrupt Mask Register */
  RoReg   IISC_RHR;           /**< \brief (IISC Offset: 0x20) Receive Holding Register */
  WoReg   IISC_THR;           /**< \brief (IISC Offset: 0x24) Transmit Holding Register */
  RoReg   IISC_VERSION;       /**< \brief (IISC Offset: 0x28) Version Register */
  RoReg   IISC_PARAMETER;     /**< \brief (IISC Offset: 0x2C) Parameter Register */
} Iisc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_IISC_COMPONENT_ */
